Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetMemberForces(Autodesk.Revit.DB.Structure.MemberForces)
Sets Member Forces to element.
Remarks:
If element already have member forces defined for that end, newly provided values replace current one.
Member forces are strictly related with releases. This means that setting member forces values is reasonable only for directions that have releases set to false.
memberForces:
End to which member forces will be added is defined by setting Autodesk::Revit::DB::Structure::MemberForces::Position
property in provided Member Forces object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetMemberForces(System.Boolean,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Adds Member Forces to element.
Remarks:
If element already have member forces defined for that end, newly provided values replace current one.
Member forces are strictly related with releases. This means that setting member forces values is reasonable only for directions that have releases set to false.
start:
Member Forces position on analytical model stick element. True for start, false for end.
force:
The translational forces at specified position of the element.
The x value of XYZ object represents force along x-axis of the analytical model coordinate system, y along y-axis, z along z-axis respectively.
moment:
The rotational forces at specified position of the element.
The x value of XYZ object represents moment about x-axis of the analytical model coordinate system, y about y-axis, z about z-axis respectively.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetProjection(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets the analytical model projection to a preset value.
selector:
End of the analytical model.
planeIdY:
Plane on to which analytical model may be projected in Y direction.
Plane identifies a Level, a Grid, or a Ref Plane.
planeIdZ:
Plane on to which analytical model may be projected in Z direction.
Plane identifies a Level, a Grid, or a Ref Plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetProjection(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.StickElementProjectionY,Autodesk.Revit.DB.ElementId)
Sets the analytical model projection to a preset value.
selector:
End of the analytical model.
projectionY:
Preset value for Analytical Model Stick projection Y.
planeIdZ:
Plane on to which analytical model may be projected in Z direction.
Plane identifies a Level, a Grid, or a Ref Plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetProjection(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.StickElementProjectionZ)
Sets the analytical model projection to a preset value.
selector:
End of the analytical model.
planeIdY:
Plane on to which analytical model may be projected in Y direction.
Plane identifies a Level, a Grid, or a Ref Plane.
projectionZ:
Preset value for Analytical Model Stick projection Z.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetLocalCoordinateSystem(Autodesk.Revit.DB.XYZ)
Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
point:
The point on the analytical model stick element.
Returns:
Transformation matrix.
x - longitudinal axis, y - transversal, section - horizontal, strong axis, z - transversal, section - vertical, weak axis, origin - base point of LCS.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The point does not lie on the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015